# -*- coding: utf_8 -*-
'''
Created on Apr 6, 2017
rాm్

@author: vimalk3
'''
import unicode_teqst
if __name__ == '__main__':
    ustr_xelugu = u'దీన్ని ప్రయత్నించడానికి, దిగువ మీ భాషను మరియు ఇన్‌పుట్ సాధనాన్ని ఎంచుకుని, టైప్ చేయడాన్ని మొదలుపెట్టండి. '
    uobj_xelugu = unicode_teqst.unicode_teqst(ustr_xelugu)
    print uobj_xelugu.xelgutr()

    # ustr_mlyalm = u'ഞയാറാഴ്ചയായിരുന്നു നന്തന്‍കോട് ക്ലിഫ് ഹൗസിന് സമീപമുള്ള നാല് പേരെ വീട്ടിനുള്ളില്‍ മരിച്ച നിലയില്‍ കണ്ടെത്തിയത് '
    ustr_mlyalm = u'തയ്യാറാക്കുന്ന വിധം  1)പച്ചരി വെള്ളത്തില്‍ ഇട്ട് 6 – 8 മണിക്കൂര്‍ കുതുര്‍ക്കാന്‍ വെക്കുക .  2) അരി അരക്കുന്നതിനു മുന്‍പ് റവ വെള്ളം ചേര്‍ത്ത് കുറുക്കി എടുക്കുക .തണുക്കാന്‍ അനുവദിക്കുക .  3)അരി കഴുകി തേങ്ങയും റവ കുറുക്കിയതും തേങ്ങ വെള്ളവും പഞ്ചസാരയും ചേര്‍ത്ത് നന്നായി അരച്ച് എടുക്കുക .  4)വെള്ളം അധികം ആകരുത് .  5)ഇതു ഒരു രാത്രി മുഴുവന്‍ പുളിക്കാന്‍ വെക്കണം  6) പിറ്റേന്ന് ആവശ്യത്തിനു ഉപ്പും ചേര്‍ത്ത് അപ്പച്ചട്ടിയില്‍ പലപ്പമായി ഉണ്ടാക്കി എടുക്കുക .അപ്പച്ചട്ടി ചൂടാകുമ്പോള്‍ ഒരു തവി മാവു ഒഴിച്ച് അപ്പച്ചട്ടി ഒരു വട്ടം ചുറ്റിച്ചു അടച്ചു വേവാന്‍ വെക്കുക .നടുക്ക് ഭാഗം നന്നായി വെന്തു കഴിയുമ്പോള്‍ ചട്ടിയില്‍ നിന്നും മാറ്റുക .പാലപ്പം തയ്യാര്‍ .  7) കിഴങ്ങു കറി, വെജിടേബിള്‍ സ്റ്റൂ ,കോഴികറി ,താറാവ് കറി , മുട്ടകറി ,ചമ്മന്തി പൊടിച്ചത് ഇവയുടെ കൂടെ നല്ലതാണ് .  തേങ്ങ വെള്ളത്തിന്‌ പകരം നല്ല തെങ്ങിൻ കള്ളു ചേർത്താൽ ഇത് കള്ളപ്പമാകും (Kallappam) കൂടുതൽ രുചിയുമുണ്ടാവും'
    uobj_mlyalm = unicode_teqst.unicode_teqst(ustr_mlyalm)
    print uobj_mlyalm.mlyalmtr()
	
    ustr_hinwi = u'अनुप्रिया वर्मा, मुंबई। जैसे धरती के गर्भ में क्या क्या छिपा है किसी को नहीं पता। लगता है ठीक वैसा ही हाल बाहुबली का है। रिलीज़ को तीन हफ़्ते से कम समय बचा है लेकिन अब भी कुछ न कुछ हैरान करने वाली ख़बरें आ रही हैं। अब मामला उस महा सीन का है, जिसके बारे में सुनकर आ चौक जाएंगे।'
    uobj_hinwi = unicode_teqst.unicode_teqst(ustr_hinwi)
    print uobj_hinwi.hinwitr()

    ustr_qnnARa = u'ಕಡೂರು ತಾಲೂಕಿನ ಪರಿಸ್ಥಿತಿ ಮತ್ತು ಬರಗಾಲವನ್ನು ಕಂಡು ಕ್ಷೇತ್ರದ ಅಭಿವೃದ್ಧಿ ಮಾಡಬೇಕೆಂದು ಪಣತೊಟ್ಟಿದ್ದಾರೆ ಡಾ. ನಿರಂತರ ಗಣೇಶ. ಅಲ್ಲದೇ ಕಡೂರು ತಾಲೂಕು ತೀರಾ ಹಿಂದುಳಿದ ತಾಲೂಕಾಗಿದ್ದು, ಯಾವುದೇ ಅಭಿವೃದ್ಧಿ ಕೆಲಸಗಳು ಆಗಿಲ್ಲ. ಈಗಾಗಲೇ ಇವರ ತಾತ ಎಸ್.ಎಂ. ಕೃಷ್ಣ ಕಾಂಗ್ರೆಸ್‍ಗೆ ಗುಡ್ ಬೈ ಹೇಳಿರೋದು ಇವರ ಮೇಲೆ ಯಾವ ಪರಿಣಾಣ ಬಿರೋದಿಲ್ಲ ಎಂದೂ ಹೇಳುತ್ತಿದ್ದಾರೆ.'
    uobj_qnnARa = unicode_teqst.unicode_teqst(ustr_qnnARa)
    print uobj_qnnARa.qnnRatr()