# -*- coding: utf_8 -*-
'''
Created on Apr 6, 2017
rాm్

@author: vimalk3
'''
import unicode_teqst
if __name__ == '__main__':
#     ustr_xelugu = u'దీన్ని ప్రయత్నించడానికి, దిగువ మీ భాషను మరియు ఇన్‌పుట్ సాధనాన్ని ఎంచుకుని, టైప్ చేయడాన్ని మొదలుపెట్టండి. '
#     uobj_xelugu = unicode_teqst.unicode_teqst(ustr_xelugu)
#     print ('ustr_xelugu  ', uobj_xelugu.ditAqttr())
# 
#     ustr_mlyalm = u'ഞയാറാഴ്ചയായിരുന്നു നന്തന്‍കോട് ക്ലിഫ് ഹൗസിന് സമീപമുള്ള നാല് പേരെ വീട്ടിനുള്ളില്‍ മരിച്ച നിലയില്‍ കണ്ടെത്തിയത് '
#     uobj_mlyalm = unicode_teqst.unicode_teqst(ustr_mlyalm)
#     print ('ustr_mlyalm  ', uobj_mlyalm.ditAqttr())
# 
#     ustr_xmil = u'ஆர்கே நகரில் வெள்ளமென பாய்ந்த பணம்.. தினகரன் 6 ஆண்டு தேர்தலில் போட்டியிட தடை?'
#     uobj_xmil = unicode_teqst.unicode_teqst(ustr_xmil)
#     print ('ustr_xmil  ', uobj_xmil.ditAqttr())
# 
#     ustr_qnnARa = u'ಕಡೂರು ತಾಲೂಕಿನ ಪರಿಸ್ಥಿತಿ ಮತ್ತು ಬರಗಾಲವನ್ನು ಕಂಡು ಕ್ಷೇತ್ರದ ಅಭಿವೃದ್ಧಿ ಮಾಡಬೇಕೆಂದು ಪಣತೊಟ್ಟಿದ್ದಾರೆ ಡಾ. ನಿರಂತರ ಗಣೇಶ. ಅಲ್ಲದೇ ಕಡೂರು ತಾಲೂಕು ತೀರಾ ಹಿಂದುಳಿದ ತಾಲೂಕಾಗಿದ್ದು, ಯಾವುದೇ ಅಭಿವೃದ್ಧಿ ಕೆಲಸಗಳು ಆಗಿಲ್ಲ. ಈಗಾಗಲೇ ಇವರ ತಾತ ಎಸ್.ಎಂ. ಕೃಷ್ಣ ಕಾಂಗ್ರೆಸ್‍ಗೆ ಗುಡ್ ಬೈ ಹೇಳಿರೋದು ಇವರ ಮೇಲೆ ಯಾವ ಪರಿಣಾಣ ಬಿರೋದಿಲ್ಲ ಎಂದೂ ಹೇಳುತ್ತಿದ್ದಾರೆ.'
#     uobj_qnnARa = unicode_teqst.unicode_teqst(ustr_qnnARa)
#     print ('ustr_qnnARa  ', uobj_qnnARa.ditAqttr())	
# 	
#     ustr_hinwi = u'अनुप्रिया वर्मा, मुंबई। जैसे धरती के गर्भ में क्या क्या छिपा है किसी को नहीं पता। लगता है ठीक वैसा ही हाल बाहुबली का है। रिलीज़ को तीन हफ़्ते से कम समय बचा है लेकिन अब भी कुछ न कुछ हैरान करने वाली ख़बरें आ रही हैं। अब मामला उस महा सीन का है, जिसके बारे में सुनकर आ चौक जाएंगे।'
#     uobj_hinwi = unicode_teqst.unicode_teqst(ustr_hinwi)
#     print ('ustr_hinwi  ', uobj_hinwi.ditAqttr())
# 
#     ustr_gujraxi = u'अनुप्रिया वर्मा, मुंबई। जैसे धरती के गर्भ में क्या क्या छिपा है किसी को नहीं पता। लगता है ठीक वैसा ही हाल बाहुबली का है। रिलीज़ को तीन हफ़्ते से कम समय बचा है लेकिन अब भी कुछ न कुछ हैरान करने वाली ख़बरें आ रही हैं। अब मामला उस महा सीन का है, जिसके बारे में सुनकर आ चौक जाएंगे।'
#     uobj_gujraxi = unicode_teqst.unicode_teqst(ustr_gujraxi)
#     print ('ustr_gujraxi  ', uobj_gujraxi.ditAqttr())
# 
#     ustr_pnjabi = u'अनुप्रिया वर्मा, मुंबई। जैसे धरती के गर्भ में क्या क्या छिपा है किसी को नहीं पता। लगता है ठीक वैसा ही हाल बाहुबली का है। रिलीज़ को तीन हफ़्ते से कम समय बचा है लेकिन अब भी कुछ न कुछ हैरान करने वाली ख़बरें आ रही हैं। अब मामला उस महा सीन का है, जिसके बारे में सुनकर आ चौक जाएंगे।'
#     uobj_pnjabi = unicode_teqst.unicode_teqst(ustr_pnjabi)
#     print ('ustr_pnjabi  ', uobj_pnjabi.ditAqttr())
# 
#     ustr_bNgali = u'গান বলেছিল, ‘কেউ যদি বেশি খাও, খাবার হিসেব নাও, কেননা অনেক লোক ভাল করে খায় না।’ রেস্তোরাঁ-হোটেলের প্লেটে খাবারের ভাগ বেঁধে দেওয়ার ইঙ্গিত সত্যিই িদল কেন্দ্র।'
#     uobj_bNgali = unicode_teqst.unicode_teqst(ustr_bNgali)
#     print ('ustr_bNgali  ', uobj_bNgali.ditAqttr())

    ustr_uRiya = u'करेलों को अच्छी तरह धो लीजिये. चाकू की सहायता से खुरच कर छील लीजिये. थोडा़ सा नमक छीलन में डाल कर रख दीजिये और थोडा़ नमक करेलों में लगा कर आधे घंटे के लिए रख दीजिए.  करेलों और छीलन को अच्छी तरह से 2 बार साफ पानी से धो लीजिए. छीलन को धोकर छलनी से छान करके इसका सारा पानी निकाल लीजिए.  पैन में 2 छोटी चम्मच तेल डाल कर गरम कीजिये. गरम तेल में जीरा, हींग, हल्दी पाउडर और छीलन डाल कर 2 मिनिट के लिए लगातार चलाते हुए भून लीजिए. फिर इसमें धनिया पाउडर सौंफ पाउडर, अमचूर, लाल मिर्च पाउडर डाल कर मिक्स कीजिए और गैस बंद कर दीजिए और इसके बाद नमक और पाउडर चीनी भी डाल दीजिये. मसाले को चमचे से चला कर अच्छी तरह से मिक्स कर लीजिए. मसाले को प्लेट में निकाल लीजिए, थोडा़ ठंडा होने दीजिए. भुना हुआ मसाला करेलों में भरने के लिये तैयार है.'

    uobj_uRiya = unicode_teqst.unicode_teqst(ustr_uRiya)
    str1 = uobj_uRiya.ditAqttr()
    str2 = str1.replace('T','th')
    str3 = str2.replace('D','dh')
    str4 = str3.replace('x','T')
    str5 = str4.replace('X','Th')
    str6 = str5.replace('w','D')
    str7 = str6.replace('W','Dh')
    print ('ustr_uRiya  ', str7)
